**Question** Hello, I require to sort through a table of information based on date and time, while taking into consideration other column variables. I would also like an explanation on how to do it as I am trying to learn this myself too. Need this done in python, using pandas.

The current scenario that I have is the table below. I have a data set for numerous days, and I would like to be see only the rows in which the high value at 10am is greater than the open value at 930am by at least 2 (ie, went from 16 to 18) and I would like to see in how many days this was true

In [5]:
import pandas as pd
import numpy as np

**Read the file**

In [2]:
df=pd.read_excel(r'/content/drive/MyDrive/Copytable.xlsx')

In [3]:
df

                 date     open     high    low    close  volume
0 2021-01-15 10:00:00  18.2500  18.7500  17.75  18.5736  202491
1 2021-01-15 09:30:00  18.6498  18.6498  18.30  18.5498    2380
2 2021-01-14 10:00:00  16.5900  16.8000  16.00  16.3500  174669
3 2021-01-14 09:30:00  16.2500  16.5000  16.20  16.5000   14271
4 2021-01-13 10:00:00  15.2190  15.8600  14.92  15.1500  213677
5 2021-01-13 09:30:00  15.1000  15.3236  14.90  15.2000   14288

Sort the rows by date in descending order

In [116]:
df=df.sort_values(by='date',ascending=False)
df

                 date     open     high    low    close  volume
0 2021-01-15 10:00:00  18.2500  18.7500  17.75  18.5736  202491
1 2021-01-15 09:30:00  18.6498  18.6498  18.30  18.5498    2380
2 2021-01-14 10:00:00  16.5900  16.8000  16.00  16.3500  174669
3 2021-01-14 09:30:00  16.2500  16.5000  16.20  16.5000   14271
4 2021-01-13 10:00:00  15.2190  15.8600  14.92  15.1500  213677
5 2021-01-13 09:30:00  15.1000  15.3236  14.90  15.2000   14288

example to show selecting the next row using shift method

In [19]:
df['open'].shift(-1)

0    18.6498
1    16.5900
2    16.2500
3    15.2190
4    15.1000
5        NaN
Name: open, dtype: float64

subtracting current value of high with next row open *value*

In [30]:
a1=df['high'] - df['open'].shift(-1)

Getting index value of the same day rows

In [29]:
df[df['date'] - df['date'].shift(-1) <="00:30:00"].index.values.tolist()

[0, 2, 4]

In [37]:
a1

0    0.1002
1    2.0598
2    0.5500
3    1.2810
4    0.7600
5       NaN
dtype: float64

0.5 is the threshould value we have selected

In [120]:
a2=(a1[df[df['date'] - df['date'].shift(-1) <="00:30:00"].index.values.tolist()] > 0.5)

**To get index of rows where value is True**

In [121]:
a3=a2[a2].index.values.tolist()

**Final Output**

In [122]:
df.iloc[a3]

                 date    open   high    low  close  volume
2 2021-01-14 10:00:00  16.590  16.80  16.00  16.35  174669
4 2021-01-13 10:00:00  15.219  15.86  14.92  15.15  213677